; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_4 ?v5 - type_1 ?v8 - type_2)
 	      (pred_2 ?v2 - object ?v8 - type_2)
	      (pred_3 ?v5 - type_1 ?v6 - type_3)
	      (pred_1 ?v5 - type_1 ?v2 - object ?v6 - type_3))

   (:action op_3
       :parameters  (?v5 - type_1 ?v4 ?v3 - type_2)
       :precondition (and  (pred_4 ?v5 ?v4))
       :effect (and  (pred_4 ?v5 ?v3)
		     (not (pred_4 ?v5 ?v4))))

   (:action op_1
       :parameters (?v5 - type_1 ?v7 - object ?v1 - type_2 ?v6 - type_3)
       :precondition  (and  (pred_2 ?v7 ?v1) (pred_4 ?v5 ?v1) (pred_3 ?v5 ?v6))
       :effect (and (pred_1 ?v5 ?v7 ?v6)
		    (not (pred_2 ?v7 ?v1)) 
		    (not (pred_3 ?v5 ?v6))))

   (:action op_2
       :parameters (?v5 - type_1 ?v7 - object ?v1 - type_2 ?v6 - type_3)
       :precondition  (and  (pred_1 ?v5 ?v7 ?v6) (pred_4 ?v5 ?v1))
       :effect (and (pred_2 ?v7 ?v1)
		    (pred_3 ?v5 ?v6)
		    (not (pred_1 ?v5 ?v7 ?v6)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_01 obj_07 - type_1
obj_03 obj_12 obj_11 obj_10 - type_3
obj_02 obj_04 obj_09 - type_2
obj_08 obj_06 obj_05 - object)
(:init
(pred_4 obj_01 obj_04)
(pred_3 obj_01 obj_03)
(pred_3 obj_01 obj_12)
(pred_4 obj_07 obj_02)
(pred_3 obj_07 obj_11)
(pred_3 obj_07 obj_10)
(pred_2 obj_08 obj_09)
(pred_2 obj_06 obj_04)
(pred_2 obj_05 obj_09)
)
(:goal
(and
(pred_2 obj_08 obj_02)
(pred_2 obj_06 obj_04)
(pred_2 obj_05 obj_02)
)
)

(:constraints
  (always (not (pred_4 obj_01 obj_09)))
)
)

; plan
1. (op_3 obj_01 obj_04 obj_02)
   deleted: (pred_4 obj_01 obj_04)
   added: (pred_4 obj_01 obj_02)
   goals met: 1 of 3
2. (op_3 obj_07 obj_02 obj_09)
   deleted: (pred_4 obj_07 obj_02)
   added: (pred_4 obj_07 obj_09)
   goals met: 1 of 3
3. (op_1 obj_07 obj_05 obj_09 obj_10)
   deleted: (pred_2 obj_05 obj_09) (pred_3 obj_07 obj_10)
   added: (pred_1 obj_07 obj_05 obj_10)
   goals met: 1 of 3
4. (op_1 obj_07 obj_08 obj_09 obj_11)
   deleted: (pred_2 obj_08 obj_09) (pred_3 obj_07 obj_11)
   added: (pred_1 obj_07 obj_08 obj_11)
   goals met: 1 of 3
5. (op_3 obj_07 obj_09 obj_02)
   deleted: (pred_4 obj_07 obj_09)
   added: (pred_4 obj_07 obj_02)
   goals met: 1 of 3
6. (op_2 obj_07 obj_05 obj_02 obj_10)
   deleted: (pred_1 obj_07 obj_05 obj_10)
   added: (pred_2 obj_05 obj_02) (pred_3 obj_07 obj_10)
   goals met: 2 of 3
7. (op_2 obj_07 obj_08 obj_02 obj_11)
   deleted: (pred_1 obj_07 obj_08 obj_11)
   added: (pred_2 obj_08 obj_02) (pred_3 obj_07 obj_11)
   goals met: 3 of 3
